; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v5 ?v12)
             (pred_10 ?v3 ?v13)
             (pred_1 ?v5 ?v13)
             (pred_2 ?v9 ?v5 )
	     (pred_4 ?v5)
             (pred_11 ?v1)
             (pred_7 ?v3)
             (pred_3 ?v13)
             (pred_8 ?v5)
             (pred_12 ?v3)
             (pred_9 ?v5)
             (pred_5 ))



(:action op_4
:parameters (?v2 ?v7 ?v11 ?v4)
:precondition (and (pred_11 ?v2) (pred_11 ?v7) (pred_7 ?v11) (pred_3 ?v4)
          (pred_6 ?v2 ?v7) (pred_10 ?v11 ?v4)
                   (pred_1 ?v7 ?v4) (pred_4 ?v2) 
                   (pred_8 ?v7) (pred_12 ?v11))
:effect (and  (pred_9 ?v7) (not (pred_8 ?v7))))


(:action op_3
:parameters (?v2 ?v10)
:precondition (and (pred_11 ?v2) (pred_11 ?v10)
               (pred_4 ?v2) (pred_6 ?v2 ?v10) (pred_9 ?v10))
:effect (and (pred_4 ?v10) (not (pred_4 ?v2))))

(:action op_1
:parameters (?v2 ?v11)
:precondition (and (pred_11 ?v2) (pred_7 ?v11) 
                  (pred_4 ?v2) (pred_2 ?v11 ?v2) (pred_5 ))
:effect (and (pred_12 ?v11)
   (not (pred_2 ?v11 ?v2)) (not (pred_5 ))))


(:action op_2
:parameters (?v2 ?v6 ?v8)
:precondition (and (pred_11 ?v2) (pred_7 ?v6) (pred_7 ?v8)
                  (pred_4 ?v2) (pred_12 ?v8) (pred_2 ?v6 ?v2))
:effect (and (pred_12 ?v6) (pred_2 ?v8 ?v2)
        (not (pred_12 ?v8)) (not (pred_2 ?v6 ?v2))))

(:action op_5
:parameters (?v2 ?v11)
:precondition (and (pred_11 ?v2) (pred_7 ?v11) 
                  (pred_4 ?v2) (pred_12 ?v11))
:effect (and (pred_5 ) (pred_2 ?v11 ?v2) (not (pred_12 ?v11)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_02 obj_13 obj_06 obj_29 obj_11 obj_31 obj_18 obj_15 obj_16 obj_24 obj_26 obj_25 obj_28 obj_23 obj_17 obj_03 obj_14 obj_10 obj_19 obj_09 obj_07 obj_08 obj_05 obj_22 obj_30
    obj_12 obj_21 obj_20
    obj_27 obj_01 obj_04
    )

    (:init
       (pred_5)

       (pred_11 obj_02)
       (pred_11 obj_13)
       (pred_11 obj_06)
       (pred_11 obj_29)
       (pred_11 obj_11)
       (pred_11 obj_31)
       (pred_11 obj_18)
       (pred_11 obj_15)
       (pred_11 obj_16)
       (pred_11 obj_24)
       (pred_11 obj_26)
       (pred_11 obj_25)
       (pred_11 obj_28)
       (pred_11 obj_23)
       (pred_11 obj_17)
       (pred_11 obj_03)
       (pred_11 obj_14)
       (pred_11 obj_10)
       (pred_11 obj_19)
       (pred_11 obj_09)
       (pred_11 obj_07)
       (pred_11 obj_08)
       (pred_11 obj_05)
       (pred_11 obj_22)
       (pred_11 obj_30)
       (pred_3 obj_12)
       (pred_3 obj_21)
       (pred_3 obj_20)
       (pred_7 obj_27)
       (pred_7 obj_01)
       (pred_7 obj_04)

       (pred_6 obj_02 obj_31)
       (pred_6 obj_02 obj_13)
       (pred_6 obj_13 obj_18)
       (pred_6 obj_13 obj_06)
       (pred_6 obj_13 obj_02)
       (pred_6 obj_06 obj_15)
       (pred_6 obj_06 obj_29)
       (pred_6 obj_06 obj_13)
       (pred_6 obj_29 obj_16)
       (pred_6 obj_29 obj_11)
       (pred_6 obj_29 obj_06)
       (pred_6 obj_11 obj_24)
       (pred_6 obj_11 obj_29)
       (pred_6 obj_31 obj_26)
       (pred_6 obj_31 obj_18)
       (pred_6 obj_31 obj_02)
       (pred_6 obj_18 obj_25)
       (pred_6 obj_18 obj_15)
       (pred_6 obj_18 obj_13)
       (pred_6 obj_18 obj_31)
       (pred_6 obj_15 obj_28)
       (pred_6 obj_15 obj_16)
       (pred_6 obj_15 obj_06)
       (pred_6 obj_15 obj_18)
       (pred_6 obj_16 obj_23)
       (pred_6 obj_16 obj_24)
       (pred_6 obj_16 obj_29)
       (pred_6 obj_16 obj_15)
       (pred_6 obj_24 obj_17)
       (pred_6 obj_24 obj_11)
       (pred_6 obj_24 obj_16)
       (pred_6 obj_26 obj_03)
       (pred_6 obj_26 obj_25)
       (pred_6 obj_26 obj_31)
       (pred_6 obj_25 obj_14)
       (pred_6 obj_25 obj_28)
       (pred_6 obj_25 obj_18)
       (pred_6 obj_25 obj_26)
       (pred_6 obj_28 obj_10)
       (pred_6 obj_28 obj_23)
       (pred_6 obj_28 obj_15)
       (pred_6 obj_28 obj_25)
       (pred_6 obj_23 obj_19)
       (pred_6 obj_23 obj_17)
       (pred_6 obj_23 obj_16)
       (pred_6 obj_23 obj_28)
       (pred_6 obj_17 obj_09)
       (pred_6 obj_17 obj_24)
       (pred_6 obj_17 obj_23)
       (pred_6 obj_03 obj_07)
       (pred_6 obj_03 obj_14)
       (pred_6 obj_03 obj_26)
       (pred_6 obj_14 obj_08)
       (pred_6 obj_14 obj_10)
       (pred_6 obj_14 obj_25)
       (pred_6 obj_14 obj_03)
       (pred_6 obj_10 obj_05)
       (pred_6 obj_10 obj_19)
       (pred_6 obj_10 obj_28)
       (pred_6 obj_10 obj_14)
       (pred_6 obj_19 obj_22)
       (pred_6 obj_19 obj_09)
       (pred_6 obj_19 obj_23)
       (pred_6 obj_19 obj_10)
       (pred_6 obj_09 obj_30)
       (pred_6 obj_09 obj_17)
       (pred_6 obj_09 obj_19)
       (pred_6 obj_07 obj_08)
       (pred_6 obj_07 obj_03)
       (pred_6 obj_08 obj_05)
       (pred_6 obj_08 obj_14)
       (pred_6 obj_08 obj_07)
       (pred_6 obj_05 obj_22)
       (pred_6 obj_05 obj_10)
       (pred_6 obj_05 obj_08)
       (pred_6 obj_22 obj_30)
       (pred_6 obj_22 obj_19)
       (pred_6 obj_22 obj_05)
       (pred_6 obj_30 obj_09)
       (pred_6 obj_30 obj_22)
       (pred_8 obj_24)
       (pred_8 obj_17)
       (pred_8 obj_26)
       (pred_1  obj_24 obj_12)
       (pred_1  obj_17 obj_21)
       (pred_1  obj_26 obj_20)
       (pred_9 obj_02)
       (pred_9 obj_13)
       (pred_9 obj_06)
       (pred_9 obj_29)
       (pred_9 obj_11)
       (pred_9 obj_31)
       (pred_9 obj_18)
       (pred_9 obj_15)
       (pred_9 obj_16)
       (pred_9 obj_25)
       (pred_9 obj_28)
       (pred_9 obj_23)
       (pred_9 obj_03)
       (pred_9 obj_14)
       (pred_9 obj_10)
       (pred_9 obj_19)
       (pred_9 obj_09)
       (pred_9 obj_07)
       (pred_9 obj_08)
       (pred_9 obj_05)
       (pred_9 obj_22)
       (pred_9 obj_30)

       (pred_10  obj_27 obj_12)
       (pred_10  obj_01 obj_21)
       (pred_10  obj_04 obj_20)
       (pred_2 obj_27 obj_16)
       (pred_2 obj_01 obj_25)
       (pred_2 obj_04 obj_07)
       (pred_4 obj_02)
    )

    (:goal (and
       (pred_2 obj_01 obj_05)
       (pred_2 obj_04 obj_06)
    ))
(:constraints
  (always (not (pred_4 obj_10)))
)
)

; plan
1. (op_3 obj_02 obj_13)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_13)
   goals met: 0 of 2
2. (op_3 obj_13 obj_18)
   deleted: (pred_4 obj_13)
   added: (pred_4 obj_18)
   goals met: 0 of 2
3. (op_3 obj_18 obj_25)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_25)
   goals met: 0 of 2
4. (op_3 obj_25 obj_14)
   deleted: (pred_4 obj_25)
   added: (pred_4 obj_14)
   goals met: 0 of 2
5. (op_3 obj_14 obj_08)
   deleted: (pred_4 obj_14)
   added: (pred_4 obj_08)
   goals met: 0 of 2
6. (op_3 obj_08 obj_07)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_07)
   goals met: 0 of 2
7. (op_1 obj_07 obj_04)
   deleted: (pred_2 obj_04 obj_07) (pred_5)
   added: (pred_12 obj_04)
   goals met: 0 of 2
8. (op_3 obj_07 obj_08)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_08)
   goals met: 0 of 2
9. (op_3 obj_08 obj_14)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_14)
   goals met: 0 of 2
10. (op_3 obj_14 obj_25)
   deleted: (pred_4 obj_14)
   added: (pred_4 obj_25)
   goals met: 0 of 2
11. (op_3 obj_25 obj_28)
   deleted: (pred_4 obj_25)
   added: (pred_4 obj_28)
   goals met: 0 of 2
12. (op_5 obj_28 obj_04)
   deleted: (pred_12 obj_04)
   added: (pred_5) (pred_2 obj_04 obj_28)
   goals met: 0 of 2
13. (op_3 obj_28 obj_25)
   deleted: (pred_4 obj_28)
   added: (pred_4 obj_25)
   goals met: 0 of 2
14. (op_1 obj_25 obj_01)
   deleted: (pred_2 obj_01 obj_25) (pred_5)
   added: (pred_12 obj_01)
   goals met: 0 of 2
15. (op_3 obj_25 obj_28)
   deleted: (pred_4 obj_25)
   added: (pred_4 obj_28)
   goals met: 0 of 2
16. (op_2 obj_28 obj_04 obj_01)
   deleted: (pred_12 obj_01) (pred_2 obj_04 obj_28)
   added: (pred_12 obj_04) (pred_2 obj_01 obj_28)
   goals met: 0 of 2
17. (op_3 obj_28 obj_15)
   deleted: (pred_4 obj_28)
   added: (pred_4 obj_15)
   goals met: 0 of 2
18. (op_3 obj_15 obj_06)
   deleted: (pred_4 obj_15)
   added: (pred_4 obj_06)
   goals met: 0 of 2
19. (op_5 obj_06 obj_04)
   deleted: (pred_12 obj_04)
   added: (pred_5) (pred_2 obj_04 obj_06)
   goals met: 1 of 2
20. (op_3 obj_06 obj_15)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_15)
   goals met: 1 of 2
21. (op_3 obj_15 obj_28)
   deleted: (pred_4 obj_15)
   added: (pred_4 obj_28)
   goals met: 1 of 2
22. (op_1 obj_28 obj_01)
   deleted: (pred_2 obj_01 obj_28) (pred_5)
   added: (pred_12 obj_01)
   goals met: 1 of 2
23. (op_3 obj_28 obj_25)
   deleted: (pred_4 obj_28)
   added: (pred_4 obj_25)
   goals met: 1 of 2
24. (op_3 obj_25 obj_14)
   deleted: (pred_4 obj_25)
   added: (pred_4 obj_14)
   goals met: 1 of 2
25. (op_3 obj_14 obj_08)
   deleted: (pred_4 obj_14)
   added: (pred_4 obj_08)
   goals met: 1 of 2
26. (op_3 obj_08 obj_05)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_05)
   goals met: 1 of 2
27. (op_5 obj_05 obj_01)
   deleted: (pred_12 obj_01)
   added: (pred_5) (pred_2 obj_01 obj_05)
   goals met: 2 of 2
